In [34]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
import re

In [41]:
engine = create_engine('mysql://scriptie:uva@localhost:3306/scriptie', echo=False)
df = pd.read_sql('SELECT * FROM affiliation', engine, index_col = 'sno')

In [10]:
df.head()

,k,name,affil,year
sno,,,,
1,conf/aaai/0001M13,Chang Wang 0001,"IBM Research, United States",2013
2,conf/aaai/0001M13,Sridhar Mahadevan,"University of Massachusetts, United States",2013
3,conf/aaai/0001T15,Claudia Schulz 0001,"Imperial College London, United Kingdom\nCompu...",2015
4,conf/aaai/0001T15,Francesca Toni,"Imperial College London, United Kingdom",2015
5,conf/aaai/0001TZLL14,Cane Wing-ki Leung,"Huawei Noah's Ark Lab, China",2014

In [11]:
df.describe()

                year
count  318510.000000
mean     2006.051477
std         7.987247
min      1960.000000
25%      2002.000000
50%      2008.000000
75%      2012.000000
max      2015.000000

In [19]:
df.head()

,k,name,affil,year
sno,,,,
1,conf/aaai/0001M13,Chang Wang 0001,"IBM Research, United States",2013
2,conf/aaai/0001M13,Sridhar Mahadevan,"University of Massachusetts, United States",2013
3,conf/aaai/0001T15,Claudia Schulz 0001,"Imperial College London, United Kingdom\nCompu...",2015
4,conf/aaai/0001T15,Francesca Toni,"Imperial College London, United Kingdom",2015
5,conf/aaai/0001TZLL14,Cane Wing-ki Leung,"Huawei Noah's Ark Lab, China",2014

In [42]:
df = df.join(df['affil'].apply(lambda x: pd.Series(x.split('\n'))))

In [51]:
df.rename(columns={0: 'affil1', 1: 'affil2'})

In [52]:
df.head()

,k,name,year,affil1,affil2
sno,,,,,
1,conf/aaai/0001M13,Chang Wang 0001,2013,"IBM Research, United States",NaN
2,conf/aaai/0001M13,Sridhar Mahadevan,2013,"University of Massachusetts, United States",NaN
3,conf/aaai/0001T15,Claudia Schulz 0001,2015,"Imperial College London, United Kingdom","Computing Department, PhD student"
4,conf/aaai/0001T15,Francesca Toni,2015,"Imperial College London, United Kingdom",NaN
5,conf/aaai/0001TZLL14,Cane Wing-ki Leung,2014,"Huawei Noah's Ark Lab, China",NaN

In [53]:
df.to_csv('dblp.csv')

In [54]:
df.to_pickle('dblp.p')